In [4]:
import pandas as pd;
import numpy as np

from pandas import Series, DataFrame

In [25]:
dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a', 'a', 'b','b', 'c', 'c', 'c'],
    'coluna 3': ['A', 'A', 'B','B', 'C', 'C', 'C'],
}

df = DataFrame(dados)
df

   coluna 1 coluna 2 coluna 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [26]:
# identificando valores duplicados
# df[df.duplicated()] # retorna um novo um nodo data frame

df.duplicated() # retorna null

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [27]:
# removendo valores duplicados
# df.drop_duplicates()

In [31]:
dados = {
    'coluna 1': [1,1,2,2,3,3,3],
    'coluna 2': ['a', 'a', 'b','b', 'c', 'c', 'c'],
    'coluna 3': ['D', 'A', 'B','B', 'C', 'C', 'C'],
}

df = DataFrame(dados)


df

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [32]:
df.drop_duplicates(['coluna 3'])

   coluna 1 coluna 2 coluna 3
0         1        a        D
1         1        a        A
2         2        b        B
4         3        c        C